In [1]:
import pyspark
import findspark

findspark.init()

In [2]:
# Create spark context in local mode
sc = pyspark.SparkContext("local")

# Create spark sql context
sqlContext = pyspark.SQLContext(sc)

In [3]:
# Read dataset into Spark dataframe
sdf = sqlContext.read.csv("train.csv", header=True, mode="DROPMALFORMED")

# Register as table
sdf.registerTempTable("tbltrain")

In [4]:
# Test query
results = sqlContext.sql("select Name from tbltrain order by Name asc limit 10")
results.toPandas()

                                                Name
0   "Andersson, Mr. August Edvard (""Wennerstrom"")"
1  "Angle, Mrs. William A (Florence ""Mary"" Agne...
2                   "Barber, Miss. Ellen ""Nellie"""
3                    "Bowen, Mr. David John ""Dai"""
4  "Bradley, Mr. George (""George Arthur Brayton"")"
5                  "Brown, Miss. Amelia ""Mildred"""
6                      "Carr, Miss. Helen ""Ellen"""
7                       "Cohen, Mr. Gurshon ""Gus"""
8               "Collyer, Miss. Marjorie ""Lottie"""
9          "Coutts, Master. Eden Leslie ""Neville"""